event_organizer/app/Models/M_Transaksi.php

    public function findTransaksi($id, $status)
    {
        return $this->db
            ->table('tbl_transaksi')
            ->join('tbl_tempat as a', 'a.id_tempat = tbl_transaksi.id_tempat', 'left')
            ->join('tbl_kategori as b', 'b.id_kategori = tbl_transaksi.id_kategori', 'left')
            ->join('tbl_paket as d', 'd.id_paket = tbl_transaksi.id_paket', 'left')
            ->select('*')
            ->where('tbl_transaksi.id_user', $id)
            ->where('tbl_transaksi.status', $status)
            ->get()->getResultArray();
---
SELECT *
FROM `tbl_transaksi`
LEFT JOIN `tbl_tempat` as `a` ON `a`.`id_tempat` = `tbl_transaksi`.`id_tempat`
LEFT JOIN `tbl_kategori` as `b` ON `b`.`id_kategori` = `tbl_transaksi`.`id_kategori`
LEFT JOIN `tbl_paket` as `d` ON `d`.`id_paket` = `tbl_transaksi`.`id_paket`
WHERE `tbl_transaksi`.`id_user` = '17'
AND `tbl_transaksi`.`status` = 'Proses'